let data = [
  "Салом! Ба Шумо чӣ кумак расонем?",

  "Барои фаъол намудани барнома лутфан бо шиносномаатон ба наздиктарин филиали бонк муроҷиат намоед.  \nАгар ба Бонк ҳозир шуда натавонед, лутфан бо шиноснома ( ё ин ки шиносномаи хориҷӣ) дар дастатон дошта, видео кунед ва дар видео гуед: 'Ман мехоҳам барномаи Спитамен Бонкамро фаъол намоям' . \nБаъдан рақамҳои мобилиро нивисед ва акси шиносномаро низ дар алоҳидагӣ равон кунед. \nЧеҳраи шумо дар видео бояд дида шавад!",

  "Барномаатон фаъол шуд, метавонед истифода баред.",

  "Маълумотномаи музди меҳнат пешниҳод карда метавонед?",

  "Агар Шумо на кам аз 3 моҳ кор ва фаъолият баред, аммо имконияти пешниҳод кардани ҳуҷҷати даромадро надошта бошед, ба Шумо метавонем қарзи скоринг пешниҳод намоем то 15 000с бо 31% солона ба мӯҳлати 24 моҳ танҳо бо шиноснома вобаста аз ҷои истиқомат.",

  "Мо ба Шумо метавонем қарзи Истеъмолиро пешниҳод намоем. Метавонед то 70000 сомони қарз гиред муҳлаташ то 24 моҳ ва 24 % мебошад, ва бо доллари ИМА бошад то 7000доллар ва 14% аст.",

  "Саломат бошед! Ташаккур барои муроҷиат!",
]

let list = document.querySelector("ol")
chrome.storage.local.get(["arr"], (result) => {
  let arr = result["arr"] || data
  arr.forEach((e) => {
    let li = document.createElement("li")
    li.setAttribute("contentEditable", "true")
    li.textContent = e
    list.appendChild(li)
  })
})
